{
    "registrationExtension": {
        "subject": "Application for Semester Registration Payment Extension and Penalty Waiver.",
        "introduction": "I hope this letter finds you in good health. I am writing to kindly request an extension of time to pay the required 40% of the semester registration fees.",
        "description": "I already paid some of my total registration fees. Unfortunately, due to some recent family issues and financial difficulties, I am currently unable to make the full payment within the given timeframe.",
        "reason": "I fully understand the importance of meeting my financial obligations, and I am actively working towards resolving the situation.",
        "details": "I respectfully request that I be granted some additional time to complete the payment without incurring any penalties.",
        "closing": "I would be extremely grateful if my request could be considered and I am allowed to proceed with registration without any penalties. Thank you for your understanding and support during this challenging time."
    },
    "leaveRequest": {
        "subject": "Application for Leave of Absence.",
        "introduction": "I hope this message finds you well.",
        "description": "I am writing to formally request a leave of absence.",
        "reason": "I am requesting a leave of absence due to [state the reason].",
        "details": "I anticipate that my leave will begin on [start date] and will last until [end date], pending your approval. I have attached any necessary documentation to support my request. Please let me know if you require any further information or paperwork to process my application.",
        "closing": "I sincerely appreciate your understanding and support during this time. I look forward to your positive response."
    },
    "longTermClassAbsence": {
        "subject": "Application for Long-Term Absence from Class.",
        "introduction": "I hope this letter finds you well. I am writing to formally request a long-term leave of absence from my classes due to unavoidable circumstances.",
        "description": "Due to [state the reason], I am unable to attend classes for an extended period. I deeply regret any inconvenience this may cause and assure you that I am committed to keeping up with my academic responsibilities.",
        "reason": "My absence is necessitated by [provide more details about the reason, such as medical treatment, family emergency, or other significant personal reasons]. I have attached any relevant documentation to support my request.",
        "details": "I anticipate that my leave will begin on [start date] and will last until [end date], pending your approval. I will make every effort to stay updated with the coursework through available resources and communicate with my instructors regarding any assignments or lectures I may miss. If there are any formalities or additional steps required to process my request, please let me know.",
        "closing": "I sincerely appreciate your understanding and support during this challenging time. I would be grateful for any guidance on how to manage my academic responsibilities during my absence. Thank you for your consideration, and I look forward to your positive response."
    }
}

